eisup_2019_docmng_integration/src/Catalogs/абс_НастройкиОбменаСSQL/абс_НастройкиОбменаСSQL.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>абс_НастройкиОбменаСSQL</name>
  <attributes>
    <name>ТипОбъекта</name>
    <comment>(Строка типа &quot;Справочник.Контрагенты&quot;)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнятьОбмен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервераSQL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяБазыДанныхSQL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяТаблицыSQL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Узел</name>
    <type>
      <types>ExchangePlanRef.абс_ОбменSQL</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерезаписыватьНайденные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьГруппыСправочника</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ОбменЧерезВерсионностьОбъектов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРегламентныеЗадания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегламентноеЗадание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматДаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодВыгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ttk_СложныйЗапрос</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ttk_Исключение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РеквизитыДляОбмена</name>
    <attributes>
      <name>ИмяРеквизитаВSQL</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПутьКДаннымРеквизита</name>
      <comment>( пример: регистрируем Спр.Контрагенты, и надо чтобы сохранялся код реквизита ссылочного типа, то пишем. &quot;НашРеквизит.Код&quot;) можно даже писать условия</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПутьКДаннымРеквизитаСУсловием</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИскатьПоРеквизиту</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>400</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыполнятьОбмен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипРеквизитаВSQL</name>
      <comment>&quot;строка&quot;/&quot;число&quot;/ &quot;логическое&quot; (0,1)/Дата, ДатаИВремя</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитГруппы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ttk_МодульПолученияДанныхРеквизита</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ttk_ОбязательноНепустой</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Catalogs/абс_НастройкиОбменаСSQL/ObjectModule.bsl
Перем мРегламентноеЗадание Экспорт;
 Процедура УстановитьПараметрыРегламентногоЗадания(РеквизитЗадания, ПараметрЗадания, КлючРегламентногоЗадания = "", Постфикс = "")
	
	Если ПараметрЗадания = Неопределено Тогда
		
		РеквизитЗадания = "";
		
	Иначе	
		
		РеквизитЗадания = Строка(ПараметрЗадания.УникальныйИдентификатор);
		
		ПараметрЗадания.Наименование = Наименование + Постфикс;
		// генерируем уникальный ключ, что бы в один момент времени 2 регламентных задания не выполнялись
		Если ПустаяСтрока(ПараметрЗадания.Ключ) Тогда
			ПараметрЗадания.Ключ = РеквизитЗадания;
		КонецЕсли;
		
		Массив = Новый Массив();
		Массив.Добавить(Код);
		
		//АБС ВСТАВКА  14.04.2014  Навценя
		Массив.Добавить("");
		//АБС ВСТАВКА  КОНЕЦ
		
		ПараметрЗадания.Параметры = Массив;
		ПараметрЗадания.Записать();	
					
	КонецЕсли;	
	
КонецПроцедуры
//Процедура ЗапуститьФоновоеЗадание()
////размерность массива - по числу параметров запускаемой в фоновом режиме процедуры
//	МассивПараметров = Новый Массив(1);
//	МассивПараметров[0] = "123-входной параметр-строка";
//	Ключ = Новый УникальныйИдентификатор; //чтобы отличить наше фоновое задание от других
//	
//	//внимание! Первый параметр - полный путь к запускаемой процедуре, включая имя общего модуля, в котором она находится.
//	ФоновыеЗадания.Выполнить("МодульРегламентныхЗаданий.ФоноваяПроцедура", МассивПараметров, Ключ, "Тестовое ФЗ"); // запуск
//		
//	ПодключитьОбработчикОжидания("ЗаполнитьТП", 1); //ждем, пока ФЗ нам что-то вернет.
//	//Важно! В данном случае применить метод ОжидатьЗавершения не получится. Если получится - пишите как.
//КонецПроцедуры
Процедура ПередЗаписью(Отказ)
	
	//АБС ВСТАВКА  10.04.2014  Навценя
	Справочники.абс_НастройкиОбменаСSQL.ИнтеграцияLotus_ПроверитьУникальностьТипаОбъекта(Ссылка, ТипОбъекта, Отказ);
	Если Отказ Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Для выбранного типа объекта уже существует настройка обмена");
		Возврат;
	КонецЕсли;
	//АБС ВСТАВКА  КОНЕЦ
	
	НужноОтключитьРегЗаданияОбмена =  ПометкаУдаления
		ИЛИ НЕ ИспользоватьРегламентныеЗадания;
	Если мРегламентноеЗадание <>Неопределено Тогда	
		Если НужноОтключитьРегЗаданияОбмена Тогда
				
			Если мРегламентноеЗадание <> Неопределено Тогда
				мРегламентноеЗадание.Использование = Ложь;			
			КонецЕсли;
						
		Иначе
			
			// если оба выключены регл задания - то включаем основное регл задание
			Если мРегламентноеЗадание = Неопределено Тогда
				
				ttk_ОбщегоНазначения.СообщитьОбОшибке("Не выбрано регламентное задание для настройки обмена.", Отказ);				
							
			КонецЕсли;
			
			Если мРегламентноеЗадание <> Неопределено Тогда
				
				мРегламентноеЗадание.Использование = Истина;
				мРегламентноеЗадание.ИмяПользователя = СокрЛП(Ответственный.Код);
				
			КонецЕсли;
				
		КонецЕсли;
		УстановитьПараметрыРегламентногоЗадания(РегламентноеЗадание, мРегламентноеЗадание);
     КонецЕсли;
	 
КонецПроцедуры
